#include "stdarg.h"
#include "./Uart_STM32F407/UartSTM32F407.h"
#include "./Uart.h"

/*********************************************************************
	funcname：UART_entryUart()
	contents：UARTの○chを使用する
	引    数： unsigned char	UART ch		<IN>
		   unsigned long	ボーレート	<IN>
		   EUARTParityType	パリティ	<IN>
		   unsigned char	BIT長		<IN>
		   unsigned char	ストップBIT	<IN>
		   ID (*)(void)		受信ハンドラ	<IN>
		   EUARTDMAMode		DMA設定		<IN>
	戻 り 値：
	備    考：なし
*********************************************************************/
extern void
UART_entryUart( unsigned char	ch,			/* ch		*/
		unsigned long	baudrate,		/* ボーレート	*/
		EUARTParityType	eParity,		/* パリティ	*/
		unsigned char	bitLength,		/* BIT長	*/
		unsigned char	stopbit		/* ストップBIT	*/
/*		EUARTDMAMode	eDMAMode	*//* DMA設定	*/
			 )
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* noting */
	/*************************************************************
		UARTの○chを使用する
	*************************************************************/
	F407_entryUart(ch, baudrate, eParity, bitLength, stopbit);
	//F407_setDMAMode(ch, eDMAMode);
}

/*********************************************************************
	funcname：UART_entryUart()
	contents：UARTの○chを未使用する
	引    数：unsigned char		UART ch		<IN>
	戻 り 値：なし
	備    考：なし
*********************************************************************/
extern void
UART_exitUart(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* noting */
	/*************************************************************
		UARTの○chを未使用する
	*************************************************************/
	F407_exitUart(ch);
}

/*********************************************************************
	funcname：UART_stopUart()
	contents：○chの動作を停止する
	引    数：unsigned char		UART ch		<IN>
	戻 り 値：なし
	備    考：
		【開始/停止順序】
		    開始時：割り込みの許可→UART動作開始→送受信動作開始
		    停止時：送受信動作停止→UART動作停止→割り込みの禁止
*********************************************************************/
extern void
UART_stopUart(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* noting */
	/*************************************************************
		○chの動作を停止する
	*************************************************************/
	F407_stopUart(ch);
}
/*********************************************************************
	funcname：UART_transmitData()
	contents：このデータを送信する
	引    数：unsigned char		UART ch		<IN>
		  unsigned char*	データアドレス	<IN>
		  unsigned long		データサイズ	<IN>
	戻 り 値：なし
	備    考：なし
*********************************************************************/
extern void
UART_transmitData(unsigned char ch ,char* fmt,...)
{
	unsigned int len;
	unsigned char USART_TX_BUF[400];
	
	va_list ap;
	va_start(ap,fmt);
	vsprintf((char*)USART_TX_BUF,fmt,ap);
	va_end(ap);
	len=strlen((const char*)USART_TX_BUF);
	F407_transmitData(ch , USART_TX_BUF, len);
}
/*********************************************************************
	funcname：UART_getDMATransferState()
	contents：DMA転送状態を取得する
	引    数：unsigned char		DMAチャネル	<IN>
	戻 り 値：EDMATransferState	DMA転送状態
		  DMA_STAT_STOP		転送停止状態（転送可能状態）
		  DMA_STAT_RUN		転送中状態   (転送不可状態)
	備    考：
	DMA転送中は、前回の転送でUART_transmitData(...)で渡した
	「送信データアドレス」バッファに書き込まないで下さい。
	
	【！！！注意！！！】
	DMA転送停止状態であっても、UART転送が終了していない場合があります。
	連続転送する場合は必ずUART_getDMATransferState()にて
	UART転送完了を確認してください。
*********************************************************************/
extern EDMATransferState
UART_getDMATransferState(unsigned char dmach)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	EDMATransferState	eState;
	/*************************************************************
		転送状態をチェック
		TCn(DCHCn.7)の状態を見る。
		DMA転送の最後の転送時にセット（１）され、
		読み出しによってクリア（０）されます。
	*************************************************************/
	return eState;
}

/*********************************************************************
	funcname：UART_getUARTTransferState()
	contents：UART転送状態を取得する
	引    数：unsigned char		UARTチャネル	<IN>
	戻 り 値：EUARTTransferState	UART転送状態
		  UART_STAT_STOP	転送停止状態（転送可能状態）
		  UART_STAT_RUN		転送中状態   (転送不可状態)
	備    考：なし
*********************************************************************/
extern EUARTTransferState
UART_getUARTTransferState(unsigned char dmach)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	EUARTTransferState	eState;
	/*************************************************************
		転送状態をチェック
		UAnTSF(UAnSTR.7)の状態を見る。
		UAnTXレジスタへの書込みでセット（１）され、
		転送完了後にUAnTXレジスタに次のデータ転送がなかった
		ときにクリア（０）されます。
		※連続転送中は常に"１"になっている。
	*************************************************************/
	return eState;
}

/*********************************************************************
	funcname：UART_getReceiveData()
	contents：受信データを取得する
	引    数：unsigned char		UART ch		<IN>
	戻 り 値：なし
	備    考：なし
*********************************************************************/
extern unsigned char
UART_getReceiveData(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	/* noting */
	/*************************************************************
		受信データを取得する
	*************************************************************/
}

/*********************************************************************
	funcname：UART_getErrorStatus()
	contents：受信エラー情報を取得する
	引    数：unsigned char		UART ch		<IN>
	戻 り 値：なし
	備    考：
	データを受信した際は必ずエラー情報の取得も行ってください。
*********************************************************************/
extern EUARTComError
UART_getErrorStatus(unsigned char ch)
{
	/*************************************************************
		自動変数定義
	*************************************************************/
	unsigned char	error  = 0x00;
	EUARTComError	eError = UART_ERR_NONE;
	/*************************************************************
		受信エラー情報を取得する
	*************************************************************/
	/*************************************************************
		変換
	*************************************************************/
	
	return	eError;
}

